---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsValid
source: html/76c81b0f-83b9-2e8c-fc16-3e4bfcace264.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsValid Method

Verified if this segment data has been assigned some valid values afer calculation.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the segment was assigned valid values, otherwise false.